MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_wwdg.c
/**
  **********************************************************************************************************************
  * @file    stm32c5xx_hal_wwdg.c
  * @brief   WWDG HAL module driver.
  *          This file provides firmware functions to manage the following
  *          functionalities of the Window Watchdog (WWDG) peripheral:
  *           + Initialization and configuration functions
  *           + I/O operation functions
  *
  **********************************************************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  **********************************************************************************************************************
  */

/* Includes ----------------------------------------------------------------------------------------------------------*/
#include "stm32_hal.h"

/** @addtogroup STM32C5xx_HAL_Driver
  * @{
  */
#if defined (WWDG)
#if defined(USE_HAL_WWDG_MODULE) && (USE_HAL_WWDG_MODULE == 1)

/** @addtogroup WWDG
  * @{
  */
/** @defgroup WWDG_Introduction WWDG Introduction
  * @{

  The WWDG hardware abstraction layer provides a set of APIs to interface with the WWDG peripheral
  on STM32 microcontrollers.

  The system window watchdog (WWDG) is used to detect the occurrence of a software fault, usually generated by
  external interference or by unforeseen logical conditions, which causes the application program to abandon
  its normal sequence.

  The WWDG clock is prescaled from the APB clock and has a configurable time-window that can be programmed to detect
  abnormally late or early application behavior.\n

  An Early Wakeup Interrupt can be generated before a reset happens to perform a system recovery or manage certain
  actions before a system restart.

  Once the WWDG is enabled, it can only be disabled by a device reset.

  The WWDG is best suited for applications requiring the watchdog to react within an accurate timing window.

  This abstraction layer guarantees portability and ease of use across different STM32 series.
  */
/**
  * @}
  */

/** @defgroup WWDG_How_To_Use WWDG How To Use
  * @{

## Main features
  - The WWDG can be started by either software or hardware (configurable through option byte).

  - Once enabled, the WWDG generates a system reset on expiry of a programmed time period, unless the program refreshes
    the counter (T[6;0] downcounter) before reaching 0x3F value (i.e. a reset is generated when the counter
    value rolls down from 0x40 to 0x3F).

  - An MCU reset is also generated if the counter value is refreshed before the counter has reached the refresh window
    value. This implies that the counter is refreshed within a limited window.

  - Once enabled, the WWDG cannot be disabled except by a system reset.

  - If required by the application, an Early Wakeup Interrupt can be triggered to provide warning before WWDG
    expiration.
    The Early Wakeup Interrupt (EWI) can be used if specific safety operations or data logging must be performed
    before the actual reset is generated. When the downcounter reaches 0x40, an interrupt occurs.
    This mechanism requires the WWDG interrupt line to be enabled in NVIC. Once enabled, the EWI interrupt cannot be
    disabled except by a system reset.

  - The WWDG counter input clock is derived from the APB clock divided by a programmable prescaler.

  - WWDG clock (Hz) = PCLK / (4096 * Prescaler)

  - WWDG timeout (ms) = 1000 * (T[5;0] + 1) / WWDG clock (Hz), where T[5;0] are the lowest 6 bits of the counter.

  - WWDG counter refresh is allowed between the following limits:
    - min time (ms) = 1000 * (Counter - Window) / WWDG clock  (The minimum time represents the earliest time before
                                   refresh is allowed)
    - max time (ms) = 1000 * (Counter - 0x40) / WWDG clock    (The maximum time represents the latest time before reset)

  - Typical values:
    - Counter min (T[5;0] = 0x00) at 56MHz (PCLK) with one prescaler:
      - WWDG step: approximately 73.14us    (The WWDG step represents the WWDG counter period)
      - max timeout before reset: 4.681ms

    - Counter max (T[5;0] = 0x3F) at 56MHz (PCLK) with prescaler dividing by 128:
      - max timeout before reset: approximately 599.18ms

## How to use
  Use the WWDG HAL driver as follows:
  - Enable the WWDG interface clock if USE_HAL_WWDG_CLK_ENABLE_MODEL = HAL_CLK_ENABLE_NO. Otherwise, it is enabled
    in HAL_WWDG_Init().

  - Configure the allowed refresh period (minimum and maximum time values) and early interrupt status using
    HAL_WWDG_Start(). The WWDG is automatically enabled and its downcounter is started.

      - HAL_WWDG_Start() computes and initializes prescaler, reload and window registers to values corresponding
        to the nearest achievable minimum and maximum time inputs.

      - Use HAL_WWDG_GetMaxTime() and HAL_WWDG_GetMinTime() to retrieve the times actually set.
        Use HAL_WWDG_GetStep_us() and HAL_WWDG_SetMinTime() to tune the refresh time.

      - Provide a maximum time value greater than 0 to prevent immediate reset generation.

      - If the Early Wakeup Interrupt (EWI) feature is enabled, an interrupt is generated when the counter reaches
        0x40. When HAL_WWDG_IRQHandler() is triggered by the interrupt service routine, the Early Wakeup flag is
        automatically cleared and the HAL_WWDG_EarlyWakeupCallback() callback is executed. Add custom code by
        implementing the HAL_WWDG_EarlyWakeupCallback() callback.

  - Refresh the WWDG counter at regular intervals during normal operation to prevent an MCU reset by calling
    HAL_WWDG_Refresh(). Perform this operation only when the counter is lower than the refresh window value already
    programmed.

