MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_wwdg.c
### Callback registration:
  - Use the compilation flag USE_HAL_WWDG_REGISTER_CALLBACKS to configure the driver callbacks dynamically.

  - Use HAL_WWDG_RegisterEarlyWakeupCallback() to register the WWDG Early Wakeup callback.\n

  - This function takes the HAL peripheral handle and a pointer to the callback function as parameters.

  - When calling HAL_WWDG_Init(), callbacks are reset to the corresponding legacy weak function,
    HAL_WWDG_EarlyWakeupCallback(), only if it has not been registered before.

  - When the compilation define USE_HAL_WWDG_REGISTER_CALLBACKS is set to 0 or not defined, the callback registration
    feature is not available and weak callbacks are used.

## Allowed Maximum time ranges:
  - Select the prescaler as follows: as long as the requested maximum time value is lower than the
    maximum time of a time range n, the algorithm keeps the same prescaler n. Once it exceeds the maximum time of
    range n, the algorithm switches to the prescaler of the range n+1.\n

  - The next table describes the possible maximum time ranges for each prescaler at a high frequency (144 MHz):\n

Note:\n
  - The theoretical floating-point values presented in the following tables are rounded to the nearest integer values
    as only integers are used as arguments and return values for WWDG APIs.

  - For a "Not supported" value in seconds, switch to the milliseconds or microseconds unit.
    Similarly, for "Not supported" values in microseconds, switch to the milliseconds or seconds unit.\n

  - To cover all ranges, a static time unit configuration is provided
  and can be expressed in microseconds, milliseconds, or seconds.
  Prescaler  |   Step(us) |   Max(us)   |   Max(ms)  |   Max(s)
  -----------|------------|-------------|------------|----------------
    1        |   28.44    |   1820.44   |   1.82     |   Not supported
    2        |   56.88    |   3640.89   |   3.64     |   Not supported
    4        |   113.77   |   7281.78   |   7.28     |   Not supported
    8        |   227.55   |   14563.6   |   14.56    |   Not supported
    16       |   455.11   |   29127.1   |   29.12    |   Not supported
    32       |   910.22   |   58254.2   |   58.25    |   Not supported
    64       |   1820.44  |   116508    |   116.5    |   Not supported
    128      |   3640.89  |   233017    |   233.01   |   Not supported

  And the possible maximum time ranges at a low frequency (17kHz), are described in next table:

  Prescaler  |   Step(us)  |   Max(us)     |   Max(ms)   |   Max(s)
  -----------|-------------|---------------|-------------|----------
    1        |  240941.17  | 15420235.29   |  15420.23   |  15.42
    2        |  481882.35  | 30840470.59   |  30840.47   |  30.84
    4        |  963764.7   | 61680941.18   |  61680.94   |  61.68
    8        |  1927529.41 | 123361882.4   |  123361.88  |  123.36
    16       |  3855058.82 | 246723764.7   |  246723.76  |  246.72
    32       |  7710117.65 | 493447529.4   |  493447.52  |  493.44
    64       |  15420235.3 | 986895058.8   |  986895.05  |  986.89
    128      |  30840470.6 | 1973790118    |  1973790.11 |  1973.79
  */
/**
  * @}
  */

/** @defgroup WWDG_Configuration_Table WWDG Configuration Table
  * @{
## Configuration inside the WWDG driver:

 |Config defines                 |Where           |Default value        |Note                                          |
 |-------------------------------|----------------|---------------------|----------------------------------------------|
 |USE_HAL_WWDG_MODULE            |hal_conf.h      |     1               |Enable the HAL WWDG module.                   |
 |USE_HAL_WWDG_REGISTER_CALLBACKS|hal_conf.h      |     0               |Enable the register callbacks assert          |
 |USE_HAL_CHECK_PARAM            |hal_conf.h      |     0               |Enable checking of vital parameters at runtime|
 |USE_HAL_WWDG_HARDWARE_START    |hal_conf.h      |     0               |WWDG driver starts in HW mode                 |
 |USE_HAL_WWDG_CLK_ENABLE_MODEL  |hal_conf.h      |HAL_CLK_ENABLE_NO    |Clock activation                              |
 |USE_HAL_WWDG_TIME_UNIT (*)     |hal_conf.h      |HAL_WWDG_TIME_UNIT_MS|Time unit to be used for WWDG driver          |
 |USE_HAL_WWDG_USER_DATA         |hal_conf.h      |     0               |Enable the set/get user data                  |
 |USE_ASSERT_DBG_PARAM           |PreProcessor env|     None            |Enable the params assert                      |
 |USE_ASSERT_DBG_STATE           |PreProcessor env|     None            |Enable the state assert                       |

(*) Select the time unit value with the USE_HAL_WWDG_TIME_UNIT define:

- HAL_WWDG_TIME_UNIT_US: WWDG driver time unit in microseconds.
- HAL_WWDG_TIME_UNIT_MS: WWDG driver time unit in milliseconds.
- HAL_WWDG_TIME_UNIT_S:  WWDG driver time unit in seconds.<br>

The default time unit is milliseconds if not set.\n\n
  */
/**
  * @}
  */

/* Private constants -------------------------------------------------------------------------------------------------*/
/** @defgroup WWDG_Private_Constants WWDG Private Constants
  * @{
  */
#define WWDG_INTERNAL_DIVIDER        4096U          /*!< WWDG Internal Divider                */
#define WWDG_MAX_STEP_NUMBER         0x40U          /*!< WWDG Max step number                 */
#define WWDG_TIME_CONVERSION         1000U          /*!< Time units conversion factor         */
#define WWDG_MAX_PRESCALER           128U           /*!< WWDG Max Prescaler                   */
/**
  * @}
  */

/* Private macros ----------------------------------------------------------------------------------------------------*/
/** @defgroup WWDG_Private_Macros WWDG Private Macros
  * @{
  */

/**
  * @brief  Retrieve the WWDG instance.
  * @param  handle  WWDG handle.
  */
#define WWDG_GET_INSTANCE(handle)  ((WWDG_TypeDef *)((uint32_t)(handle)->instance))

/**
  * @brief  WWDG maximum time for maximum prescaler and Time unit in microseconds, milliseconds and seconds.
  * @param  freq  PCLK frequency.
  */
#if (USE_HAL_WWDG_TIME_UNIT == HAL_WWDG_TIME_UNIT_US)

#define WWDG_ALLOWED_MAX_TIME(freq) \
  (((freq) < 10000000U) ? \
   ((WWDG_INTERNAL_DIVIDER * WWDG_MAX_PRESCALER * WWDG_MAX_STEP_NUMBER * 100U) / ((freq) / 100U) * 100U) : \
   ((WWDG_INTERNAL_DIVIDER * WWDG_MAX_PRESCALER * WWDG_MAX_STEP_NUMBER * 100U) / ((freq) / 1000U) * 10U))

#elif (USE_HAL_WWDG_TIME_UNIT == HAL_WWDG_TIME_UNIT_MS)

#define WWDG_ALLOWED_MAX_TIME(freq) \
  ((WWDG_INTERNAL_DIVIDER * WWDG_MAX_PRESCALER * WWDG_MAX_STEP_NUMBER * 100U) / ((freq) / 10U))

