MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_wwdg.c
#else /* USE_HAL_WWDG_TIME_UNIT == HAL_WWDG_TIME_UNIT_S */

#define WWDG_ALLOWED_MAX_TIME(freq) \
  ((WWDG_INTERNAL_DIVIDER * WWDG_MAX_PRESCALER * WWDG_MAX_STEP_NUMBER) / (freq))

#endif /* USE_HAL_WWDG_TIME_UNIT */


/**
  * @brief  Check WWDG maximum time value.
  * @param  max_time  Maximum value time before a WWDG reset.
  * @param  freq      PCLK frequency.
  * @warning  max_time must not exceed WWDG_ALLOWED_MAX_TIME based on the frequency and time unit values
  *           selected in configuration.
  */
#define IS_WWDG_MAX_TIME(max_time, freq) ((max_time) <= (WWDG_ALLOWED_MAX_TIME(freq)))

/**
  * @brief  Check WWDG minimum time value.
  * @param  min_time  Minimum value time before refreshing is allowed.
  * @param  max_time  Maximum value time before a WWDG reset.
  */
#define IS_WWDG_MIN_TIME(min_time, max_time) ((min_time) <= (max_time))

/**
  * @brief  Check WWDG early wakeup enable value.
  * @param  ewi_status  WWDG early wakeup interrupt status.
  */
#define IS_WWDG_EWI_STATUS(ewi_status) ((ewi_status) == 1U) || ((ewi_status) == 0U)
/**
  * @}
  */

/* Private variables -------------------------------------------------------------------------------------------------*/
/* Private function prototypes ---------------------------------------------------------------------------------------*/
/** @defgroup WWDG_Private_Functions WWDG Private Functions
  * @{
  */
static uint8_t  WWDG_CalculatePrescaler(const hal_wwdg_handle_t *hwwdg, uint32_t max_time);
static uint16_t WWDG_CalculateReload(const hal_wwdg_handle_t *hwwdg, uint8_t prescaler, uint32_t max_time);
static uint16_t WWDG_CalculateWindow(const hal_wwdg_handle_t *hwwdg, uint8_t prescaler, uint32_t min_time);
static uint32_t WWDG_CalculateMaxTime(const hal_wwdg_handle_t *hwwdg, uint8_t prescaler);
static uint32_t WWDG_CalculateMinTime(const hal_wwdg_handle_t *hwwdg, uint8_t prescaler, uint16_t window);
/**
  * @}
  */

/* Exported functions ------------------------------------------------------------------------------------------------*/
/** @addtogroup WWDG_Exported_Functions
  * @{
  */

/** @addtogroup WWDG_Exported_Functions_Group1 Initialization and Start functions
  * @{
This subsection provides a set of functions to initialize and start the WWDG peripheral:
  - Call the function HAL_WWDG_Init() to initialize the WWDG handle and associate an instance.
  - Call the function HAL_WWDG_Start() to start the WWDG with the provided parameters.
  */

/**
  * @brief   Initialize the WWDG according to the associated handle.
  * @param   hwwdg    Pointer to a hal_wwdg_handle_t structure that contains the configuration information for
  *                   the specified WWDG module.
  * @param   instance WWDG instance.
  *
  * @warning In case of starting WWDG in Hardware mode, make sure that USE_HAL_WWDG_HARDWARE_START is aligned with
  *          the WWDG_SW option byte.
  *
  * @retval  HAL_OK             HAL operation completed successfully.
  * @retval  HAL_INVALID_PARAM  HAL invalid parameter.
  */
hal_status_t HAL_WWDG_Init(hal_wwdg_handle_t *hwwdg, hal_wwdg_t instance)
{
  ASSERT_DBG_PARAM(hwwdg != NULL);
  ASSERT_DBG_PARAM(IS_WWDG_ALL_INSTANCE((WWDG_TypeDef *)(uint32_t)instance));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1U)
  if (hwwdg == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  hwwdg->instance = instance;

#if defined(USE_HAL_WWDG_REGISTER_CALLBACKS) && (USE_HAL_WWDG_REGISTER_CALLBACKS == 1U)
  hwwdg->p_early_wakeup_cb = HAL_WWDG_EarlyWakeupCallback;
#endif /* USE_HAL_WWDG_REGISTER_CALLBACKS */

#if defined (USE_HAL_WWDG_USER_DATA) && (USE_HAL_WWDG_USER_DATA == 1U)
  hwwdg->p_user_data = NULL;
#endif /* USE_HAL_WWDG_USER_DATA */

#if !defined(USE_HAL_WWDG_HARDWARE_START) || (USE_HAL_WWDG_HARDWARE_START != 1UL)
  if (LL_WWDG_IsEnabled(WWDG_GET_INSTANCE(hwwdg)) == 0U)
  {
#if defined(USE_HAL_WWDG_CLK_ENABLE_MODEL) && (USE_HAL_WWDG_CLK_ENABLE_MODEL >= HAL_CLK_ENABLE_PERIPH_ONLY)
    HAL_RCC_WWDG_EnableClock();
#endif /* USE_HAL_WWDG_CLK_ENABLE_MODEL */

    hwwdg->global_state = HAL_WWDG_STATE_IDLE;
  }
  else
#endif /* !USE_HAL_WWDG_HARDWARE_START */
  {
    hwwdg->global_state = HAL_WWDG_STATE_ACTIVE;
  }

  return HAL_OK;
}

/**
  * @brief   Start the WWDG. Before exiting the function, the watchdog counter is refreshed to have a correct time base.
  * @param   hwwdg      Pointer to a hal_wwdg_handle_t structure that contains the configuration information for
  *                     the specified WWDG module.
  * @param   min_time   Minimum time value before refreshing is allowed.
  * @param   max_time   Maximum time value before a WWDG reset.
  * @param   ewi_status Early Wakeup Interrupt activation.
  *
  * @note    The default time unit is milliseconds if not specified through USE_HAL_WWDG_TIME_UNIT define.
  *
  * @warning The max_time and min_time are used to define the reload and the window values, the unit for these
  *          parameters depends on the switch USE_HAL_WWDG_TIME_UNIT.
  * @warning Set ewi_status to zero when the Early Wakeup Interrupt feature is not used.
  *
  * @retval  HAL_OK  HAL operation completed successfully.
  */
hal_status_t HAL_WWDG_Start(hal_wwdg_handle_t *hwwdg, uint32_t min_time, uint32_t max_time, uint32_t ewi_status)
{
  uint32_t frequency;
  uint16_t window;
  uint8_t  prescaler;

  ASSERT_DBG_PARAM(hwwdg != NULL);

  frequency = HAL_RCC_GetPCLK1Freq();
  hwwdg->pclk_frequency_hz = frequency;

  ASSERT_DBG_PARAM(IS_WWDG_MAX_TIME(max_time, frequency));
  ASSERT_DBG_PARAM(IS_WWDG_MIN_TIME(min_time, max_time));
  ASSERT_DBG_PARAM(IS_WWDG_EWI_STATUS(ewi_status));

#if defined(USE_HAL_WWDG_HARDWARE_START) && (USE_HAL_WWDG_HARDWARE_START == 1U)
  ASSERT_DBG_STATE(hwwdg->global_state, (uint32_t)HAL_WWDG_STATE_ACTIVE);

#else
  ASSERT_DBG_STATE(hwwdg->global_state, (uint32_t)HAL_WWDG_STATE_IDLE | (uint32_t)HAL_WWDG_STATE_ACTIVE);

  if (LL_WWDG_IsEnabled(WWDG_GET_INSTANCE(hwwdg)) == 0U)
  {
    HAL_CHECK_UPDATE_STATE(hwwdg, global_state, (uint32_t)HAL_WWDG_STATE_IDLE, HAL_WWDG_STATE_ACTIVE);
  }

#endif /* USE_HAL_WWDG_HARDWARE_START */

