MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_wwdg.c
  prescaler = WWDG_CalculatePrescaler(hwwdg, max_time);

  hwwdg->reload = WWDG_CalculateReload(hwwdg, prescaler, max_time);

  window = WWDG_CalculateWindow(hwwdg, prescaler, min_time);

  if (ewi_status != 0U)
  {
    LL_WWDG_EnableIT_EWKUP(WWDG_GET_INSTANCE(hwwdg));
  }

  /* Enable the WWDG driver and set the reload value to work with */
  LL_WWDG_SetControl(WWDG_GET_INSTANCE(hwwdg), hwwdg->reload << WWDG_CR_T_Pos);

  /* Write to WWDG CFR register the Prescaler and Window values to work with */
  LL_WWDG_SetConfig(WWDG_GET_INSTANCE(hwwdg), ((uint32_t)prescaler << WWDG_CFR_WDGTB_Pos),
                    ((uint32_t)window << WWDG_CFR_W_Pos));

  return HAL_OK;
}
/**
  * @}
  */

/** @addtogroup WWDG_Exported_Functions_Group2 I/O operation function
  * @{
This subsection provides a function to manage the refresh of the WWDG counter:
  - Call the function HAL_WWDG_Refresh() to reload WWDG counter with value defined in the reload register.
  */

/**
  * @brief   Refresh the WWDG counter.
  * @param   hwwdg   Pointer to a hal_wwdg_handle_t structure that contains the configuration information for
  *                  the specified WWDG module.
  * @retval  HAL_OK  HAL operation completed successfully.
  */
hal_status_t HAL_WWDG_Refresh(hal_wwdg_handle_t *hwwdg)
{
  ASSERT_DBG_PARAM(hwwdg != NULL);
  ASSERT_DBG_STATE(hwwdg->global_state, HAL_WWDG_STATE_ACTIVE);

  LL_WWDG_SetCounter(WWDG_GET_INSTANCE(hwwdg), hwwdg->reload << WWDG_CR_T_Pos);

  return HAL_OK;
}
/**
  * @}
  */

/** @addtogroup WWDG_Exported_Functions_Group3 State function
  * @{
This subsection provides a function to retrieve the state value:
  - Call the function HAL_WWDG_GetState() to retrieve the WWDG handle state.
  */

/**
  * @brief  Return the WWDG handle state.
  * @param  hwwdg  Pointer to a hal_wwdg_handle_t structure that contains
  *                the configuration information for the specified WWDG module.
  * @retval HAL_WWDG_STATE_RESET  WWDG driver not initialized and not started.
  * @retval HAL_WWDG_STATE_IDLE   WWDG driver initialized and not started.
  * @retval HAL_WWDG_STATE_ACTIVE WWDG driver initialized and started.
  */
hal_wwdg_state_t HAL_WWDG_GetState(const hal_wwdg_handle_t *hwwdg)
{
  ASSERT_DBG_PARAM(hwwdg != NULL);

  return hwwdg->global_state;
}
/**
  * @}
  */

/** @addtogroup WWDG_Exported_Functions_Group4 Set/Get item functions
  * @{
This subsection provides a set of functions to set and retrieve configuration items separately for the WWDG driver:
  - Call the function HAL_WWDG_GetMaxTime() to retrieve the current maximum time value.
  - Call the function HAL_WWDG_GetStep_us() to retrieve the current counter period.
  - Call the function HAL_WWDG_SetMinTime() to set only the Window time value.
  - Call the function HAL_WWDG_GetMinTime() to retrieve the current Window time value.

@note The prescaler is calculated from maximum time once in the HAL_WWDG_Start() function. To avoid
  a change of prescaler, no function is provided to set the maximum time because it can modify the prescaler
  and thus require recalculating the Window.
  To modify the maximum time, call HAL_WWDG_Start().
  */

/**
  * @brief   Get the maximum time value according to the handle registers.
  * @param   hwwdg    Pointer to a hal_wwdg_handle_t structure that contains the configuration information for
  *                   the specified WWDG module.
  * @retval uint32_t  Current maximum time value.
  */
uint32_t HAL_WWDG_GetMaxTime(const hal_wwdg_handle_t *hwwdg)
{
  ASSERT_DBG_PARAM(hwwdg != NULL);
  ASSERT_DBG_STATE(hwwdg->global_state, HAL_WWDG_STATE_ACTIVE);

  return WWDG_CalculateMaxTime(hwwdg, (uint8_t)(LL_WWDG_GetPrescaler(WWDG_GET_INSTANCE(hwwdg)) >> WWDG_CFR_WDGTB_Pos));
}

/**
  * @brief  Get the WWDG counter period in microseconds.
  * @param  hwwdg  Pointer to a hal_wwdg_handle_t structure that contains
  *                the configuration information for the specified WWDG module.
  *
  * @note   HAL_WWDG_GetStep_us is provided to allow calculation of max_time and min_time
  *                           to avoid rounded values.
  *
  * @retval uint32_t  Current counter period value in us.
  */
uint32_t HAL_WWDG_GetStep_us(const hal_wwdg_handle_t *hwwdg)
{
  uint64_t freq_khz;
  uint64_t clk_divider;
  uint64_t computed_step = 0U;

  ASSERT_DBG_PARAM(hwwdg != NULL);
  ASSERT_DBG_STATE(hwwdg->global_state, HAL_WWDG_STATE_ACTIVE);

  clk_divider = (((uint64_t)1) << (LL_WWDG_GetPrescaler(WWDG_GET_INSTANCE(hwwdg)) >> WWDG_CFR_WDGTB_Pos)) *
                WWDG_INTERNAL_DIVIDER;

  freq_khz = (uint64_t)hwwdg->pclk_frequency_hz / 1000U;

  if (freq_khz > 0U)
  {
    computed_step = (clk_divider * 1000U) / freq_khz;

    if (((clk_divider * 1000U) % freq_khz) >= (freq_khz / (uint64_t)2))
    {
      computed_step += 1U;
    }
  }

  return (uint32_t)computed_step;
}

/**
  * @brief   Set the Window time value.
  * @param   hwwdg     Pointer to a hal_wwdg_handle_t structure that contains the configuration information for
  *                    the specified WWDG module.
  * @param   min_time  Minimum time value before refreshing is allowed.
  *
  * @warning Refresh the WWDG counter before calling this function.
  *
  * @retval HAL_OK  HAL operation completed successfully.
  */
hal_status_t HAL_WWDG_SetMinTime(hal_wwdg_handle_t *hwwdg, uint32_t min_time)
{
  uint8_t prescaler;
  uint16_t window;

  ASSERT_DBG_PARAM(hwwdg != NULL);

  prescaler = (uint8_t)(LL_WWDG_GetPrescaler(WWDG_GET_INSTANCE(hwwdg)) >> WWDG_CFR_WDGTB_Pos);

  ASSERT_DBG_PARAM(IS_WWDG_MIN_TIME(min_time, WWDG_CalculateMaxTime(hwwdg, prescaler)));
  ASSERT_DBG_STATE(hwwdg->global_state, HAL_WWDG_STATE_ACTIVE);

  window = WWDG_CalculateWindow(hwwdg, prescaler, min_time);

  LL_WWDG_SetWindow(WWDG_GET_INSTANCE(hwwdg), (uint32_t)window << WWDG_CFR_W_Pos);

  return HAL_OK;
}

/**
  * @brief  Get the Window time value according to the handle registers.
  * @param  hwwdg     Pointer to a hal_wwdg_handle_t structure that contains the configuration information for
  *                   the specified WWDG module.
  * @retval uint32_t  Current Window time value.
  */
uint32_t HAL_WWDG_GetMinTime(const hal_wwdg_handle_t *hwwdg)
{
  ASSERT_DBG_PARAM(hwwdg != NULL);
  ASSERT_DBG_STATE(hwwdg->global_state, HAL_WWDG_STATE_ACTIVE);

  return WWDG_CalculateMinTime(hwwdg, (uint8_t)(LL_WWDG_GetPrescaler(WWDG_GET_INSTANCE(hwwdg)) >> WWDG_CFR_WDGTB_Pos),
                               (uint16_t)(LL_WWDG_GetWindow(WWDG_GET_INSTANCE(hwwdg)) >> WWDG_CFR_W_Pos));
}
/**
  * @}
  */

/** @addtogroup WWDG_Exported_Functions_Group5 IRQ Handler/Callbacks/Register Callbacks functions
  * @{
This subsection provides a set of functions to register the WWDG process and callbacks:

  - Call the function HAL_WWDG_IRQHandler() to handle WWDG interrupts.

There are two ways to use callbacks:\n\n
Override the weak callback function. Call HAL_WWDG_EarlyWakeupCallback() to indicate
that an early interrupt is pending.\n
Or register callbacks. Call HAL_WWDG_RegisterEarlyWakeupCallback() to register
the Early Wakeup callback.
  */

/**
  * @brief  Handle WWDG interrupt request.
  * @param  hwwdg  Pointer to a hal_wwdg_handle_t structure that contains the configuration information for
  *                the specified WWDG module.
  *
  * @note   The Early Wakeup Interrupt (EWI) can be used if specific safety operations or data logging must be
  *         performed before the actual reset is generated. The EWI interrupt is enabled by calling HAL_WWDG_Start()
  *         function with an ewi_status equal to 1. When the downcounter reaches the value 0x40,
  *         an EWI interrupt is generated and the corresponding Interrupt Service Routine (ISR) can be used to trigger
  *         specific actions (such as communications or data logging) before resetting the device.
  */
void HAL_WWDG_IRQHandler(hal_wwdg_handle_t *hwwdg)
{
  ASSERT_DBG_PARAM(hwwdg != NULL);

  if (LL_WWDG_IsEnabledIT_EWKUP(WWDG_GET_INSTANCE(hwwdg)) != 0U)
  {
    if (LL_WWDG_IsActiveFlag_EWKUP(WWDG_GET_INSTANCE(hwwdg)) != 0U)
    {
      LL_WWDG_ClearFlag_EWKUP(WWDG_GET_INSTANCE(hwwdg));

