MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_wwdg.c
#if defined(USE_HAL_WWDG_REGISTER_CALLBACKS) && (USE_HAL_WWDG_REGISTER_CALLBACKS == 1U)
      hwwdg->p_early_wakeup_cb(hwwdg);
#else
      HAL_WWDG_EarlyWakeupCallback(hwwdg);
#endif /* USE_HAL_WWDG_REGISTER_CALLBACKS */
    }
  }
}

/**
  * @brief  WWDG Early Wakeup callback.
  * @param  hwwdg  Pointer to a hal_wwdg_handle_t structure that contains the configuration information for
  *                the specified WWDG module.
  */
__WEAK void HAL_WWDG_EarlyWakeupCallback(hal_wwdg_handle_t *hwwdg)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hwwdg);

  /*! <b>WARNING:</b> Do not modify this function. Implement HAL_WWDG_EarlyWakeupCallback()
                      in the application file when a callback is needed. */
}

#if defined(USE_HAL_WWDG_REGISTER_CALLBACKS) && (USE_HAL_WWDG_REGISTER_CALLBACKS == 1U)
/**
  * @brief   Register the WWDG Early Wakeup callback.
  * @param   hwwdg      Pointer to a hal_wwdg_handle_t structure that contains the configuration information for
  *                     the specified WWDG module.
  * @param   p_callback Pointer to the hal_wwdg_cb_t callback function.
  * @retval  HAL_OK             HAL operation completed successfully.
  * @retval  HAL_INVALID_PARAM  HAL invalid parameter.
  */
hal_status_t HAL_WWDG_RegisterEarlyWakeupCallback(hal_wwdg_handle_t *hwwdg, hal_wwdg_cb_t p_callback)
{
  ASSERT_DBG_PARAM(hwwdg != NULL);
  ASSERT_DBG_PARAM(p_callback != NULL);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1U)
  if (p_callback == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  hwwdg->p_early_wakeup_cb = p_callback;

  return HAL_OK;
}

#endif /* USE_HAL_WWDG_REGISTER_CALLBACKS */
/**
  * @}
  */

#if defined (USE_HAL_WWDG_USER_DATA) && (USE_HAL_WWDG_USER_DATA == 1U)

/** @addtogroup WWDG_Exported_Functions_Group6 User Data Function
  * @{
This subsection provides functions to set user-specific data for a WWDG instance:
  - HAL_WWDG_SetUserData(): Set user data in the handle.
  - HAL_WWDG_GetUserData(): Get user data from the handle.
  */

/**
  * @brief Store the user data pointer in the handle.
  * @param hwwdg       Pointer to a \ref hal_wwdg_handle_t structure which contains the WWDG instance.
  * @param p_user_data Pointer to the user data.
  */
void HAL_WWDG_SetUserData(hal_wwdg_handle_t *hwwdg, const void *p_user_data)
{
  ASSERT_DBG_PARAM(hwwdg != NULL);

  hwwdg->p_user_data = p_user_data;
}

/**
  * @brief  Retrieve the user data pointer from the handle.
  * @param  hwwdg Pointer to a \ref hal_wwdg_handle_t structure which contains the WWDG instance.
  * @retval Pointer to the user data.
  */
const void *HAL_WWDG_GetUserData(const hal_wwdg_handle_t *hwwdg)
{
  ASSERT_DBG_PARAM(hwwdg != NULL);

  return (hwwdg->p_user_data);
}
/**
  * @}
  */

#endif /* USE_HAL_WWDG_USER_DATA */
/**
  * @}
  */

/* Private functions -------------------------------------------------------------------------------------------------*/
/** @addtogroup WWDG_Private_Functions WWDG Private Functions
  * @{
  */

/**
  * @brief   Calculate the WWDG prescaler from the configured maximum time.
  * @param   hwwdg    Pointer to a hal_wwdg_handle_t structure that contains the configuration information for
  *                   the specified WWDG module.
  * @param   max_time Maximum time value before a WWDG reset.
  * @retval  0 for a prescaler = 1.
  * @retval  1 for a prescaler = 2.
  * @retval  2 for a prescaler = 4.
  * @retval  3 for a prescaler = 8.
  * @retval  4 for a prescaler = 16.
  * @retval  5 for a prescaler = 32.
  * @retval  6 for a prescaler = 64.
  * @retval  7 for a prescaler = 128.
  */
static uint8_t WWDG_CalculatePrescaler(const hal_wwdg_handle_t *hwwdg, uint32_t max_time)
{
  uint32_t max_period;

#if (USE_HAL_WWDG_TIME_UNIT == HAL_WWDG_TIME_UNIT_US)
  max_period  = ((max_time * (hwwdg->pclk_frequency_hz / (WWDG_MAX_STEP_NUMBER * WWDG_INTERNAL_DIVIDER))) /
                 1000000UL);
#elif (USE_HAL_WWDG_TIME_UNIT == HAL_WWDG_TIME_UNIT_MS)
  max_period  = (((max_time * (hwwdg->pclk_frequency_hz / WWDG_MAX_STEP_NUMBER)) / WWDG_INTERNAL_DIVIDER) /
                 1000UL);
#elif (USE_HAL_WWDG_TIME_UNIT == HAL_WWDG_TIME_UNIT_S)
  max_period  = ((max_time * (hwwdg->pclk_frequency_hz / WWDG_MAX_STEP_NUMBER)) / WWDG_INTERNAL_DIVIDER);
#endif /* USE_HAL_WWDG_TIME_UNIT */

  /* Return the calculated prescaler */
  return (uint8_t)(32U - __CLZ(max_period));
}

/**
  * @brief   Extract the WWDG reload parameter from the configured maximum time.
  * @param   hwwdg     Pointer to a hal_wwdg_handle_t structure that contains the configuration information for
  *                    the specified WWDG module.
  * @param   prescaler WWDG prescaler.
  * @param   max_time  Maximum time value before a WWDG reset.
  * @retval  uint16_t  Current reload parameter.
  */
static uint16_t WWDG_CalculateReload(const hal_wwdg_handle_t *hwwdg, uint8_t prescaler, uint32_t max_time)
{
  uint32_t reload;
  uint32_t clk_divider;

  clk_divider = (uint32_t)(1UL << (prescaler & 0x7U));

#if (USE_HAL_WWDG_TIME_UNIT == HAL_WWDG_TIME_UNIT_US)
  reload  = ((max_time * (hwwdg->pclk_frequency_hz / (clk_divider * WWDG_INTERNAL_DIVIDER))) / 1000000UL) +
            WWDG_MAX_STEP_NUMBER;
#elif (USE_HAL_WWDG_TIME_UNIT == HAL_WWDG_TIME_UNIT_MS)
  reload  = (((max_time * (hwwdg->pclk_frequency_hz / clk_divider)) / WWDG_INTERNAL_DIVIDER) / 1000UL) +
            WWDG_MAX_STEP_NUMBER;
#elif (USE_HAL_WWDG_TIME_UNIT == HAL_WWDG_TIME_UNIT_S)
  reload  = ((max_time * (hwwdg->pclk_frequency_hz / clk_divider)) / WWDG_INTERNAL_DIVIDER) + WWDG_MAX_STEP_NUMBER;
#endif /* USE_HAL_WWDG_TIME_UNIT */

  return (uint16_t)reload;
}

/**
  * @brief   Extract the WWDG window parameter from the configured minimum time.
  * @param   hwwdg     Pointer to a hal_wwdg_handle_t structure that contains the configuration information for
  *                    the specified WWDG module.
  * @param   prescaler WWDG prescaler.
  * @param   min_time  Minimum time value before refreshing is allowed.
  * @retval  uint16_t  Current Window parameter.
  */
static uint16_t WWDG_CalculateWindow(const hal_wwdg_handle_t *hwwdg, uint8_t prescaler, uint32_t min_time)
{
  uint32_t window;
  uint32_t clk_divider;

  clk_divider = (uint32_t)(1UL << (prescaler & 0x7U));

#if (USE_HAL_WWDG_TIME_UNIT == HAL_WWDG_TIME_UNIT_US)
  window = hwwdg->reload - ((min_time * (hwwdg->pclk_frequency_hz / (clk_divider * WWDG_INTERNAL_DIVIDER)))
                            / 1000000UL);
#elif (USE_HAL_WWDG_TIME_UNIT == HAL_WWDG_TIME_UNIT_MS)
  window = hwwdg->reload - ((min_time * (hwwdg->pclk_frequency_hz / (clk_divider * WWDG_INTERNAL_DIVIDER)))
                            / 1000UL);
#elif (USE_HAL_WWDG_TIME_UNIT == HAL_WWDG_TIME_UNIT_S)
  window = hwwdg->reload - ((min_time * (hwwdg->pclk_frequency_hz / clk_divider)) / WWDG_INTERNAL_DIVIDER);
#endif /* USE_HAL_WWDG_TIME_UNIT */

  return (uint16_t)window;
}

/**
  * @brief   Calculate the WWDG maximum time value before a WWDG reset from the reload value.
  * @param   hwwdg     Pointer to a hal_wwdg_handle_t structure that contains the configuration information for
  *                    the specified WWDG module.
  * @param   prescaler WWDG prescaler.
  * @retval  uint32_t  Current maximum time.
  */
static uint32_t WWDG_CalculateMaxTime(const hal_wwdg_handle_t *hwwdg, uint8_t prescaler)
{
  uint64_t max_time = 0U;
  uint64_t tmp;
  uint64_t freq_khz;

