MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_wwdg.c
  tmp = (((uint64_t)hwwdg->reload - (uint64_t)WWDG_MAX_STEP_NUMBER) * (uint64_t)WWDG_INTERNAL_DIVIDER) *
        ((uint64_t)1 << prescaler);

  freq_khz = (uint64_t)hwwdg->pclk_frequency_hz / 1000U;

  if (freq_khz > 0U)
  {
    max_time = (tmp * 1000U) / freq_khz;

#if (USE_HAL_WWDG_TIME_UNIT == HAL_WWDG_TIME_UNIT_US)
    max_time = (uint32_t)(((max_time * WWDG_TIME_CONVERSION) + 500U) / 1000U);
#elif (USE_HAL_WWDG_TIME_UNIT == HAL_WWDG_TIME_UNIT_MS)
    max_time = (uint32_t)((max_time + 500U) / 1000U);
#elif (USE_HAL_WWDG_TIME_UNIT == HAL_WWDG_TIME_UNIT_S)
    max_time = (uint32_t)((max_time + (WWDG_TIME_CONVERSION * 1000U / 2U)) / (WWDG_TIME_CONVERSION * 1000U));
#endif /* USE_HAL_WWDG_TIME_UNIT */
  }

  return (uint32_t)max_time;
}

/**
  * @brief   Calculate the WWDG minimum time value before refreshing is allowed from the window value.
  * @param   hwwdg     Pointer to a hal_wwdg_handle_t structure that contains the configuration information for
  *                    the specified WWDG module.
  * @param   prescaler WWDG prescaler.
  * @param   window    Corresponding window parameter.
  * @retval  uint32_t  Current minimum time.
  */
static uint32_t WWDG_CalculateMinTime(const hal_wwdg_handle_t *hwwdg, uint8_t prescaler, uint16_t window)
{
  uint64_t min_time = 0U;
  uint64_t tmp;
  uint64_t freq_khz;

  tmp = ((uint64_t)hwwdg->reload - (uint64_t)window) * (uint64_t)WWDG_INTERNAL_DIVIDER * ((uint64_t)1 << prescaler);

  freq_khz = (uint64_t)hwwdg->pclk_frequency_hz / 1000U;

  if (freq_khz > 0U)
  {
    min_time = (tmp * 1000U) / freq_khz;

#if (USE_HAL_WWDG_TIME_UNIT == HAL_WWDG_TIME_UNIT_US)
    min_time = (uint32_t)(((min_time * WWDG_TIME_CONVERSION) + 500U) / 1000U);
#elif (USE_HAL_WWDG_TIME_UNIT == HAL_WWDG_TIME_UNIT_MS)
    min_time = (uint32_t)((min_time + 500U) / 1000U);
#elif (USE_HAL_WWDG_TIME_UNIT == HAL_WWDG_TIME_UNIT_S)
    min_time = (uint32_t)((min_time + ((WWDG_TIME_CONVERSION * 1000U) / 2U)) / (WWDG_TIME_CONVERSION * 1000U));
#endif /* USE_HAL_WWDG_TIME_UNIT */
  }

  return (uint32_t)min_time;
}
/**
  * @}
  */

/**
  * @}
  */

#endif /* USE_HAL_WWDG_MODULE */
#endif /* WWDG */
/**
  * @}
  */

